#include <iostream>
#include <string>

using namespace std;

int main() {
    unsigned int F;
    // 0 <= F <= 65535
    cin >> F;

    cout << "Номер сеанса: " << ((F >> 8) & 0xFF) << endl;
    cout << "Атрибуты:" << endl;
    cout << "Сеанс состоялся: " << (((F >> 7) & 1) ? "да" : "нет") << endl;
    cout << "Зарубежный фильм: " << (((F >> 6) & 1) ? "да" : "нет") << endl;
    cout << "Ограничение по возрасту: " << (((F >> 5) & 1) ? "да" : "нет") << endl;
    cout << "Наличие субтитров: " << (((F >> 4) & 1) ? "да" : "нет") << endl;
    cout << "3D: " << (((F >> 3) & 1) ? "да" : "нет") << endl;
    cout << "IMAX: " << (((F >> 2) & 1) ? "да" : "нет") << endl;
    cout << "Аншлаг: " << (((F >> 1) & 1) ? "да" : "нет") << endl;
    cout << "Премьера: " << ((F & 1) ? "да" : "нет") << endl;

    return 0;
}
